oe-rv2309/mugen-riscv/logs_failed/fio/oe_test_fio_002/2023-08-08-14_28_48.log
+ source ./common/disk_lib.sh
++ source /root/mugen/libs/locallibs/common_lib.sh
+++ python3 --version
+++ '[' 0 -eq 0 ']'
+++ source /root/mugen/libs/locallibs/common_lib_python.sh
+ main
++ type -t post_test
+ '[' -n function ']'
+ trap post_test EXIT INT HUP TERM
+ rpm -qa
+ grep expect
++ type -t config_params
+ '[' -n '' ']'
++ type -t pre_test
+ '[' -n function ']'
+ pre_test
+ LOG_INFO 'Start to prepare the test environment!'
+ message='Start to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start to prepare the test environment!'
Tue Aug  8 14:29:03 2023 - INFO  - Start to prepare the test environment!
+ check_free_disk
++ TEST_DISK
++ id=1
++ python3 /root/mugen/libs/locallibs/get_test_device.py --device disk --node 1
+ disks=vdb
+ disk_list=($disks)
+ local_disk=vdb
+ local_disk1=
+ local_disk2=
+ local_disk3=
+ DNF_INSTALL fio
+ pkgs=fio
+ node=1
+ '[' -z '' ']'
+ tmpfile=
++ python3 /root/mugen/libs/locallibs/rpm_manage.py install --pkgs fio --node 1 --tempfile ''
Tue Aug  8 14:30:09 2023 - INFO  - pkgs:(fio) is already installed
+ tmpfile2=
+ '[' -z '' ']'
+ tmpfile=
+ test -f test.txt
+ touch test.txt
+ LOG_INFO 'End to prepare the test environment!'
+ message='End to prepare the test environment!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'End to prepare the test environment!'
Tue Aug  8 14:30:14 2023 - INFO  - End to prepare the test environment!
++ type -t run_test
+ '[' -n function ']'
+ run_test
+ LOG_INFO 'Start executing testcase!'
+ message='Start executing testcase!'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level info --message 'Start executing testcase!'
Tue Aug  8 14:30:18 2023 - INFO  - Start executing testcase!
+ fio-dedupe -o 1 /dev/vdb
+ grep 'items processed'
Threads(4): 128000 items processed
+ CHECK_RESULT 0 0 0 'fio-dedupe -o option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -o option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio-dedupe -c 1 /dev/
+ grep 'items processed'
+ CHECK_RESULT 1 0 0 'fio-dedupe -c option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -c option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -c option failed'
+ LOG_ERROR 'fio-dedupe -c option failed'
+ message='fio-dedupe -c option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -c option failed'
Tue Aug  8 14:30:30 2023 - ERROR - fio-dedupe -c option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 33'
+ message='oe_test_fio_002.sh line 33'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 33'
Tue Aug  8 14:30:34 2023 - ERROR - oe_test_fio_002.sh line 33
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -B 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -B option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -B option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -B option failed'
+ LOG_ERROR 'fio-dedupe -B option failed'
+ message='fio-dedupe -B option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -B option failed'
Tue Aug  8 14:30:38 2023 - ERROR - fio-dedupe -B option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 35'
+ message='oe_test_fio_002.sh line 35'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 35'
Tue Aug  8 14:30:43 2023 - ERROR - oe_test_fio_002.sh line 35
+ '[' 0 -eq 1 ']'
+ return 0
+ fio-dedupe -p 1 /dev/
+ CHECK_RESULT 1 0 0 'fio-dedupe -p option failed'
+ actual_result=1
+ expect_result=0
+ mode=0
+ error_log='fio-dedupe -p option failed'
+ exit_mode=0
+ '[' -z 1 ']'
+ '[' 0 -eq 0 ']'
+ test 1x '!=' 0x
+ test -n 'fio-dedupe -p option failed'
+ LOG_ERROR 'fio-dedupe -p option failed'
+ message='fio-dedupe -p option failed'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'fio-dedupe -p option failed'
Tue Aug  8 14:30:48 2023 - ERROR - fio-dedupe -p option failed
+ (( exec_result++ ))
+ LOG_ERROR 'oe_test_fio_002.sh line 37'
+ message='oe_test_fio_002.sh line 37'
+ python3 /root/mugen/libs/locallibs/mugen_log.py --level error --message 'oe_test_fio_002.sh line 37'
Tue Aug  8 14:30:52 2023 - ERROR - oe_test_fio_002.sh line 37
+ '[' 0 -eq 1 ']'
+ return 0
+ fio --filename=test_file --direct=1 --rw=randwrite --numjobs=1 --iodepth=16 --ioengine=libaio --bs=4k --group_reporting --name=zhangyi --log_avg_msec=500 --write_bw_log=test-fio --size=1G
zhangyi: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.34
Starting 1 process
zhangyi: Laying out IO file (1 file / 1024MiB)

zhangyi: (groupid=0, jobs=1): err= 0: pid=691: Tue Aug  8 14:50:23 2023
  write: IOPS=224, BW=897KiB/s (919kB/s)(1024MiB/1168687msec); 0 zone resets
    slat (usec): min=560, max=359480, avg=3476.90, stdev=5753.46
    clat (usec): min=127, max=1118.0k, avg=67626.22, stdev=30621.26
     lat (usec): min=1655, max=1119.4k, avg=71103.12, stdev=31827.67
    clat percentiles (msec):
     |  1.00th=[   34],  5.00th=[   40], 10.00th=[   43], 20.00th=[   48],
     | 30.00th=[   53], 40.00th=[   57], 50.00th=[   62], 60.00th=[   67],
     | 70.00th=[   73], 80.00th=[   82], 90.00th=[   96], 95.00th=[  114],
     | 99.00th=[  174], 99.50th=[  211], 99.90th=[  359], 99.95th=[  477],
     | 99.99th=[  726]
   bw (  KiB/s): min=   23, max= 1472, per=100.00%, avg=898.49, stdev=185.40, samples=2307
   iops        : min=    5, max=  368, avg=224.28, stdev=46.35, samples=2307
  lat (usec)   : 250=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.04%, 50=24.17%
  lat (msec)   : 100=67.23%, 250=8.23%, 500=0.25%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=6.24%, sys=59.97%, ctx=142745, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=897KiB/s (919kB/s), 897KiB/s-897KiB/s (919kB/s-919kB/s), io=1024MiB (1074MB), run=1168687-1168687msec

Disk stats (read/write):
  vda: ios=1/268317, merge=0/95322, ticks=1/707804, in_queue=724190, util=76.77%
+ CHECK_RESULT 0 0 0 'fio --filename=test_file option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio --filename=test_file option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=read -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
  vdb: ios=959662/0, merge=0/0, ticks=4554593/0, in_queue=4554593, util=75.54%
+ CHECK_RESULT 0 0 0 'fio -filename=/dev option failed'
+ actual_result=0
+ expect_result=0
+ mode=0
+ error_log='fio -filename=/dev option failed'
+ exit_mode=0
+ '[' -z 0 ']'
+ '[' 0 -eq 0 ']'
+ test 0x '!=' 0x
+ return 0
+ fio -filename=/dev/vdb -direct=1 -iodepth 1 -thread -rw=write -ioengine=psync -bs=16k -size=200G -numjobs=30 -runtime=1000 -group_reporting -name=mytest
+ grep vdb
Tue Aug  8 14:58:52 2023 - ERROR - Timeout : Command 'bash -x oe_test_fio_002.sh' timed out after 1799.9973322 seconds